if OS.mac?
    cask_args appdir: '/Applications'

    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    cask "kitty"
    cask "imageoptim"
    cask "notion"
    cask "hazel"
    cask "anybar"
    cask "istat-menus"
    cask "rocket"
    cask "timing"

    cask "anki"
    cask "alfred"
    cask "hammerspoon"
    cask "karabiner-elements"
    cask "keycastr"
    cask "libreoffice"
    cask "skim"
    cask "virtualbox"
    cask "visual-studio-code"
    cask "vlc"

    # Broswers

    # Fonts
    cask "font-hack-nerd-font"
    cask "font-fira-code-nerd-font"

    # macOS App Store
    mas "Fantastical", id: 975937182
end

    tap "homebrew/services"
    tap "buo/cask-upgrade"

# Custom taps
    tap "koekeishiya/formulae"
    tap "cmacrae/formulae"

    brew "readline"
    brew "xz"
    brew "python@3.9"
    brew "python@3.8"
    brew "bash"
    brew "cocoapods"
    brew "cowsay"
    brew "ctags"
    brew "enchant"
    brew "exercism"
    brew "ffsend"
    brew "fish"
    brew "fortune"
    brew "fzf"
    brew "gdb"
    brew "ninja"
    brew "girara"
    brew "git"
    brew "go"
    brew "jq"
    brew "lazydocker"
    brew "lazygit"
    brew "llvm"
    brew "lolcat"
    brew "luajit", args: ["HEAD"]
    brew "make"
    brew "mono"
    brew "neofetch"
    brew "neovim", args: ["HEAD"]
    brew "node"
    brew "pyenv"
    brew "ripgrep"
    brew "sassc"
    brew "sphinx-doc"
    brew "tmux"
    brew "tree"
    brew "clementtsang/bottom/bottom"
    brew "spacebar"
    brew "skhd"
    brew "yabai"
    brew "yarn"
    brew "cmake"
    brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
    brew "starship"

    brew "ack"
    brew "bat"
    brew "cloc"
    brew "diff-so-fancy"
    brew "entr"
    brew "exa"
    brew "fd"
    brew "gh"
    brew "gnupg"
    brew "highlight"
    brew "markdown"
    brew "schniz/tap/fnm"
    brew "shellcheck"
    brew "wdiff"
    brew "wget"
