cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Custom taps
tap "koekeishiya/formulae"
tap "cmacrae/formulae"

brew "mas"
brew "readline"
brew "xz"
brew "python@3.9"
brew "python@3.8"
brew "bash"
brew "cocoapods"
brew "cowsay"
brew "ctags"
brew "enchant"
brew "exercism"
brew "ffsend"
brew "fish"
brew "fortune"
brew "fzf"
brew "gdb"
brew "ninja"
brew "girara"
brew "git"
brew "go"
brew "htop"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "lolcat"
brew "luajit", args: ["HEAD"]
brew "make"
brew "mono"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pyenv"
brew "ripgrep"
brew "sassc"
brew "sphinx-doc"
brew "tmux"
brew "tree"
brew "clementtsang/bottom/bottom"
brew "spacebar"
brew "skhd"
brew "yabai"
brew "yarn"
brew "cmake"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

cask "anki"
cask "alacritty"
cask "alfred"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "keycastr"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "libreoffice"
cask "notion"
cask "skim"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
